backend/app/models/case.rb

  def generate_case_number
    return if case_number.present?
    last_case = Case.order(created_at: :desc).first
---
SELECT `cases`.* FROM `cases` ORDER BY `cases`.`created_at` DESC LIMIT 1