backend/app/controllers/api/auth_controller.rb

  def login
    user = User.find_by(email: params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'cs@demo.com' LIMIT 1