backend/app/controllers/api/cases_controller.rb

SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1 LIMIT 1
SELECT `sites`.* FROM `sites` WHERE `sites`.`id` = 1 LIMIT 1
---
  def set_case
    @case = Case.includes(
      :client, :site, :contact, :assigned_to, :created_by,
      :cost_approved_by, :final_cost_approved_by,
      case_attachments: { file_attachment: :blob }
    ).find(params[:id])