backend/app/controllers/api/cases_controller.rb

  def index
    cases = Case.includes(:client, :site, :contact, :assigned_to, :created_by)

    cases = cases.where(status: params[:status]) if params[:status].present?
    cases = cases.where(case_type: params[:case_type]) if params[:case_type].present?
    cases = cases.where(assigned_to_id: params[:assigned_to]) if params[:assigned_to].present?
    cases = cases.where(assigned_to_id: nil) if params[:assigned_to] == 'unassigned'
    cases = cases.where(current_stage: params[:stage]) if params[:stage].present?

    cases = cases.order(created_at: :desc)

    render json: cases.map { |c| case_json(c) }
---
SELECT `cases`.* FROM `cases` ORDER BY `cases`.`created_at` DESC
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` IN (2, 1)
SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` IN (4, 1)
SELECT `sites`.* FROM `sites` WHERE `sites`.`id` IN (3, 1)
SELECT `cases`.* FROM `cases` WHERE `cases`.`status` = 'open' ORDER BY `cases`.`created_at` DESC
SELECT `cases`.* FROM `cases` WHERE `cases`.`status` = 'open' AND `cases`.`case_type` = 'repair' AND `cases`.`assigned_to_id` = NULL AND `cases`.`assigned_to_id` IS NULL ORDER BY `cases`.`created_at` DESC
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1
SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1
SELECT `sites`.* FROM `sites` WHERE `sites`.`id` = 1

  def create
    @case = Case.new(case_params)
    @case.created_by = current_user
    @case.current_stage = 1
    @case.status = 'open'

    if @case.save
---
INSERT INTO `cases` (`case_number`, `client_id`, `site_id`, `contact_id`, `created_by_id`, `assigned_to_id`, `description`, `case_type`, `priority`, `investigation_report`, `investigation_checklist`, `root_cause`, `solution_description`, `solution_checklist`, `planned_execution_date`, `cost_required`, `estimated_cost`, `cost_description`, `cost_status`, `cost_approved_by_id`, `execution_report`, `execution_checklist`, `client_signature`, `client_feedback`, `client_rating`, `cs_notes`, `final_feedback`, `final_rating`, `current_stage`, `status`, `attempt_number`, `created_at`, `updated_at`) VALUES ('C-0001', 1, 1, 1, 1, NULL, 'Bong tróc sơn', 'warranty', 'high', NULL, NULL, NULL, NULL, NULL, NULL, FALSE, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, 'open', 1, '2025-12-17 14:36:41.528792', '2025-12-17 14:36:41.528792')
INSERT INTO `cases` (`case_number`, `client_id`, `site_id`, `contact_id`, `created_by_id`, `assigned_to_id`, `description`, `case_type`, `priority`, `investigation_report`, `investigation_checklist`, `root_cause`, `solution_description`, `solution_checklist`, `planned_execution_date`, `cost_required`, `estimated_cost`, `cost_description`, `cost_status`, `cost_approved_by_id`, `execution_report`, `execution_checklist`, `client_signature`, `client_feedback`, `client_rating`, `cs_notes`, `final_feedback`, `final_rating`, `current_stage`, `status`, `attempt_number`, `created_at`, `updated_at`) VALUES ('C-0003', 2, 3, 4, 1, NULL, 'Rớt gương chiếu hậu', 'maintenance', 'low', NULL, NULL, NULL, NULL, NULL, NULL, FALSE, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, 'open', 1, '2025-12-17 15:25:14.301009', '2025-12-17 15:25:14.301009')

  def update
    if @case.update(case_params)
---
UPDATE `cases` SET `cases`.`root_cause` = '', `cases`.`solution_description` = '', `cases`.`solution_checklist` = '[true,true]', `cases`.`planned_execution_date` = '2025-12-18', `cases`.`cost_required` = TRUE, `cases`.`estimated_cost` = 9.0, `cases`.`cost_description` = 'Sử dụng hãng tốt', `cases`.`updated_at` = '2025-12-17 14:55:58.483730' WHERE `cases`.`id` = 1

  def advance_stage
    if @case.current_stage < 5
      # Check cost approval for stage 3
      if @case.current_stage == 3 && @case.cost_required && @case.cost_status != 'approved'
        return render json: { error: 'Cost approval required before advancing' }, status: :unprocessable_entity
      end

      @case.update(current_stage: @case.current_stage + 1)
---
UPDATE `cases` SET `cases`.`current_stage` = 2, `cases`.`updated_at` = '2025-12-17 14:42:46.070554' WHERE `cases`.`id` = 1

  def approve_cost
    unless current_user.leader?
      return render json: { error: 'Only leaders can approve costs' }, status: :forbidden
    end

    @case.update(cost_status: 'approved', cost_approved_by: current_user)
---
UPDATE `cases` SET `cases`.`cost_status` = 'approved', `cases`.`cost_approved_by_id` = 3, `cases`.`updated_at` = '2025-12-17 15:00:27.464792' WHERE `cases`.`id` = 1

  def set_case
    @case = Case.find(params[:id])
---
SELECT `cases`.* FROM `cases` WHERE `cases`.`id` = 2 LIMIT 1