backend/app/controllers/api/clients_controller.rb

SELECT `clients`.* FROM `clients` ORDER BY `clients`.`name` ASC
---
  def index
    clients = Client.all.order(:name)

SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
SELECT `sites`.* FROM `sites` WHERE `sites`.`client_id` = 1 ORDER BY `sites`.`name` ASC
---
  def sites
    client = Client.find(params[:id])
    sites = client.sites.order(:name)