backend/app/controllers/api/sites_controller.rb

  def contacts
    site = Site.find(params[:id])
    contacts = site.contacts.order(:name)
---
SELECT `sites`.* FROM `sites` WHERE `sites`.`id` = 2 LIMIT 1
SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`site_id` = 2 ORDER BY `contacts`.`name` ASC