backend/app/controllers/api/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`role` = 'technician' ORDER BY `users`.`name` ASC
---
  def technicians
    users = User.where(role: 'technician').order(:name)